Revit 2024 API
BendingDetailFor3DShapesOptions Enumeration
 Describes how the Bending Detail will be represented for 3D shapes.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailFor3DShapesOptions
Visual Basic
Public Enumeration BendingDetailFor3DShapesOptions
Visual C++
public enum class BendingDetailFor3DShapesOptions
Members
Member name | Description
IsometricView |  The bending detail will represent the bar as in an isometric view.
PlanView |  The bending detail will represent the bar as in a plan view where the view plane is parallel with bar plane.
See Also
Autodesk.Revit.DB.Structure Namespace